Revit 2024 API
CurveByPointsArray Class
An array that can contain CurveByPoints elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CurveByPointsArray : APIObject,
	IEnumerable
Visual Basic
Public Class CurveByPointsArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class CurveByPointsArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurveByPointsArray
See Also
CurveByPointsArray Members
Autodesk.Revit.DB Namespace